-- MySQL dump 10.13  Distrib 5.5.50, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: cities
-- ------------------------------------------------------
-- Server version	5.5.50-0ubuntu0.14.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `cities`
--

-- CREATE DATABASE /*!32312 IF NOT EXISTS*/ `cities` /*!40100 DEFAULT CHARACTER SET utf8 COLLATE utf8_unicode_ci */;

-- USE `cities`;

--
-- Table structure for table `city`
--

DROP TABLE IF EXISTS `city`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `city` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `state_id` tinyint(4) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=461 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `city`
--

LOCK TABLES `city` WRITE;
/*!40000 ALTER TABLE `city` DISABLE KEYS */;
INSERT INTO `city` VALUES (1,'Авдіївка',5),(2,'Алмазна',12),(3,'Алупка',1),(4,'Алушта',1),(5,'Алчевськ',12),(6,'Амвросіївка',5),(7,'Ананьїв',15),(8,'Андрушівка',6),(9,'Антрацит',12),(10,'Апостолове',4),(11,'Армянськ',1),(12,'Арциз',15),(13,'Балаклія',20),(14,'Балта',15),(15,'Бар',2),(16,'Баранівка',6),(17,'Барвінкове',20),(18,'Батурин',25),(19,'Бахмач',25),(20,'Бахмут',5),(21,'Бахчисарай',1),(22,'Баштанка',14),(23,'Белз',13),(24,'Бердичів',6),(25,'Бердянськ',8),(26,'Берегове',7),(27,'Бережани',19),(28,'Березань',10),(29,'Березівка',15),(30,'Березне',17),(31,'Берестечко',3),(32,'Берислав',21),(33,'Бершадь',2),(34,'Бібрка',13),(35,'Біла Церква',10),(36,'Білгород-Дністровський',15),(37,'Білицьке',5),(38,'Білогірськ',1),(39,'Білозерське',5),(40,'Білопілля',18),(41,'Біляївка',15),(42,'Благовіщенське',11),(43,'Бобринець',11),(44,'Бобровиця',25),(45,'Богодухів',20),(46,'Богуслав',10),(47,'Боково-Хрустальне',12),(48,'Болград',15),(49,'Болехів',9),(50,'Борзна',25),(51,'Борислав',13),(52,'Бориспіль',10),(53,'Борщів',19),(54,'Боярка',10),(55,'Бровари',10),(56,'Броди',13),(57,'Брянка',12),(58,'Бунге',5),(59,'Буринь',18),(60,'Бурштин',9),(61,'Буськ',13),(62,'Буча',10),(63,'Бучач',19),(64,'Валки',20),(65,'Вараш',17),(66,'Василівка',8),(67,'Васильків',10),(68,'Ватутіне',23),(69,'Вашківці',24),(70,'Великі Мости',13),(71,'Верхівцеве',4),(72,'Верхньодніпровськ',4),(73,'Вижниця',24),(74,'Вилкове',15),(75,'Винники',13),(76,'Виноградів',7),(77,'Вишгород',10),(78,'Вишневе',10),(79,'Вільногірськ',4),(80,'Вільнянськ',8),(81,'Вінниця',2),(82,'Вовчанськ',20),(83,'Вознесенськ',14),(84,'Волноваха',5),(85,'Володимир-Волинський',3),(86,'Волочиськ',22),(87,'Ворожба',18),(88,'Вуглегірськ',5),(89,'Вугледар',5),(90,'Гадяч',16),(91,'Гайворон',11),(92,'Гайсин',2),(93,'Галич',9),(94,'Генічеськ',21),(95,'Герца',24),(96,'Гірник',5),(97,'Гірське',12),(98,'Глиняни',13),(99,'Глобине',16),(100,'Глухів',18),(101,'Гнівань',2),(102,'Гола Пристань',21),(103,'Голубівка',12),(104,'Горішні Плавні',16),(105,'Горлівка',5),(106,'Городенка',9),(107,'Городище',23),(108,'Городня',25),(109,'Городок',13),(110,'Городок',22),(111,'Горохів',3),(112,'Гребінка',16),(113,'Гуляйполе',8),(114,'Дебальцеве',5),(115,'Деражня',22),(116,'Дергачі',20),(117,'Джанкой',1),(118,'Дніпро2',4),(119,'Дніпрорудне',8),(120,'Добромиль',13),(121,'Добропілля',5),(122,'Довжанськ',12),(123,'Докучаєвськ',5),(124,'Долина',9),(125,'Долинська',11),(126,'Донецьк',5),(127,'Дрогобич',13),(128,'Дружба',18),(129,'Дружківка',5),(130,'Дубляни',13),(131,'Дубно',17),(132,'Дубровиця',17),(133,'Дунаївці',22),(134,'Енергодар',8),(135,'Євпаторія',1),(136,'Єнакієве',5),(137,'Жашків',23),(138,'Жданівка',5),(139,'Жидачів',13),(140,'Житомир',6),(141,'Жмеринка',2),(142,'Жовква',13),(143,'Жовті Води',4),(144,'Заводське',16),(145,'Залізне',5),(146,'Заліщики',19),(147,'Запоріжжя',8),(148,'Заставна',24),(149,'Збараж',19),(150,'Зборів',19),(151,'Звенигородка',23),(152,'Здолбунів',17),(153,'Зеленодольськ',4),(154,'Зимогір\'я',12),(155,'Зіньків',16),(156,'Зміїв',20),(157,'Знам\'янка',11),(158,'Золоте',12),(159,'Золотоноша',23),(160,'Золочів',13),(161,'Зоринськ',12),(162,'Зугрес',5),(163,'Івано-Франківськ',9),(164,'Ізмаїл',15),(165,'Ізюм',20),(166,'Ізяслав',22),(167,'Іллінці',2),(168,'Іловайськ',5),(169,'Інкерман',1),(170,'Ірміно',12),(171,'Ірпінь',10),(172,'Іршава',7),(173,'Ічня',25),(174,'Кагарлик',10),(175,'Кадіївка',12),(176,'Калинівка',2),(177,'Калуш',9),(178,'Кальміуське',5),(179,'Камінь-Каширський',3),(180,'Кам\'янець-Подільський',22),(181,'Кам\'янка',23),(182,'Кам\'янка-Бузька',13),(183,'Кам\'янка-Дніпровська',8),(184,'Кам\'янське',4),(185,'Канів',23),(186,'Карлівка',16),(187,'Каховка',21),(188,'Керч',1),(189,'Київ',10),(190,'Кипуче',12),(191,'Ківерці',3),(192,'Кілія',15),(193,'Кіцмань',24),(194,'Кобеляки',16),(195,'Ковель',3),(196,'Кодима',15),(197,'Козятин',2),(198,'Коломия',9),(199,'Комарно',13),(200,'Конотоп',18),(201,'Копичинці',19),(202,'Корець',17),(203,'Коростень',6),(204,'Коростишів',6),(205,'Корсунь-Шевченківський',23),(206,'Корюківка',25),(207,'Косів',9),(208,'Костопіль',17),(209,'Костянтинівка',5),(210,'Краматорськ',5),(211,'Красилів',22),(212,'Красногорівка',5),(213,'Красноград',20),(214,'Красноперекопськ (Яни Капу)',1),(215,'Кременець',19),(216,'Кременчук',16),(217,'Кремінна',12),(218,'Кривий Ріг [3]',4),(219,'Кролевець',18),(220,'Кропивницький',11),(221,'Куп\'янськ',20),(222,'Курахове',5),(223,'Ладижин',2),(224,'Ланівці',19),(225,'Лебедин',18),(226,'Лиман',5),(227,'Липовець',2),(228,'Лисичанськ',12),(229,'Лозова',20),(230,'Лохвиця',16),(231,'Лубни',16),(232,'Луганськ',12),(233,'Лутугине',12),(234,'Луцьк',3),(235,'Львів',13),(236,'Любомль',3),(237,'Люботин',20),(238,'Макіївка',5),(239,'Мала Виска',11),(240,'Малин',6),(241,'Мар\'їнка',5),(242,'Марганець',4),(243,'Маріуполь',5),(244,'Мелітополь',8),(245,'Мена',25),(246,'Мерефа',20),(247,'Миколаїв',13),(248,'Миколаїв',14),(249,'Миколаївка',5),(250,'Миргород',16),(251,'Мирноград[1]',5),(252,'Миронівка',10),(253,'Міусинськ',12),(254,'Могилів-Подільський',2),(255,'Молодогвардійськ',12),(256,'Молочанськ',8),(257,'Монастириська',19),(258,'Монастирище',23),(259,'Моршин',13),(260,'Моспине',5),(261,'Мостиська',13),(262,'Мукачеве',7),(263,'Надвірна',9),(264,'Немирів',2),(265,'Нетішин',22),(266,'Ніжин',25),(267,'Нікополь',4),(268,'Нова Каховка',21),(269,'Нова Одеса',14),(270,'Новгород-Сіверський',25),(271,'Новий Буг',14),(272,'Новий Калинів',13),(273,'Новий Розділ',13),(274,'Новоазовськ',5),(275,'Нововолинськ',3),(276,'Новоград-Волинський',6),(277,'Новогродівка',5),(278,'Новодністровськ',24),(279,'Новодружеськ',12),(280,'Новомиргород',11),(281,'Новомосковськ',4),(282,'Новоселиця',24),(283,'Новоукраїнка',11),(284,'Новояворівськ',13),(285,'Носівка',25),(286,'Обухів',10),(287,'Овруч',6),(288,'Одеса',15),(289,'Олевськ',6),(290,'Олександрівськ',12),(291,'Олександрія',11),(292,'Олешки',21),(293,'Оріхів',8),(294,'Остер',25),(295,'Острог',17),(296,'Охтирка',18),(297,'Очаків',14),(298,'Павлоград',4),(299,'Первомайськ',12),(300,'Первомайськ',14),(301,'Первомайський',20),(302,'Перевальськ',12),(303,'Перемишляни',13),(304,'Перечин',7),(305,'Перещепине',4),(306,'Переяслав-Хмельницький',10),(307,'Першотравенськ',4),(308,'Петрово-Красносілля',12),(309,'Пирятин',16),(310,'Південне',20),(311,'Підгайці',19),(312,'Підгородне',4),(313,'Погребище',2),(314,'Подільськ',15),(315,'Покров',4),(316,'Покровськ',5),(317,'Пологи',8),(318,'Полонне',22),(319,'Полтава',16),(320,'Помічна',11),(321,'Попасна',12),(322,'Почаїв',19),(323,'Привілля',12),(324,'Прилуки',25),(325,'Приморськ',8),(326,'Прип\'ять',10),(327,'Пустомити',13),(328,'Путивль',18),(329,'П\'ятихатки',4),(330,'Рава-Руська',13),(331,'Радехів',13),(332,'Радивилів',17),(333,'Радомишль',6),(334,'Рахів',7),(335,'Рені',15),(336,'Ржищів',10),(337,'Рівне',17),(338,'Ровеньки',12),(339,'Рогатин',9),(340,'Родинське',5),(341,'Рожище',3),(342,'Роздільна',15),(343,'Ромни',18),(344,'Рубіжне',12),(345,'Рудки',13),(346,'Саки',1),(347,'Самбір',13),(348,'Сарни',17),(349,'Свалява',7),(350,'Сватове',12),(351,'Світловодськ',11),(352,'Світлодарськ',5),(353,'Святогірськ',5),(354,'Севастополь',1),(355,'Селидове',5),(356,'Семенівка',25),(357,'Середина-Буда',18),(358,'Сєвєродонецьк',12),(359,'Синельникове',4),(360,'Сіверськ',5),(361,'Сімферополь',1),(362,'Скадовськ',21),(363,'Скалат',19),(364,'Сквира',10),(365,'Сколе',13),(366,'Славута',22),(367,'Славутич',10),(368,'Слов\'янськ',5),(369,'Сміла',23),(370,'Снігурівка',14),(371,'Сніжне',5),(372,'Сновськ',25),(373,'Снятин',9),(374,'Сокаль',13),(375,'Сокиряни',24),(376,'Соледар',5),(377,'Сорокине',12),(378,'Соснівка',13),(379,'Старий Крим',1),(380,'Старий Самбір',13),(381,'Старобільськ',12),(382,'Старокостянтинів',22),(383,'Стебник',13),(384,'Сторожинець',24),(385,'Стрий',13),(386,'Судак',1),(387,'Судова Вишня',13),(388,'Суми',18),(389,'Суходільськ',12),(390,'Таврійськ',21),(391,'Тальне',23),(392,'Тараща',10),(393,'Татарбунари',15),(394,'Теплодар',15),(395,'Теребовля',19),(396,'Тернівка',4),(397,'Тернопіль',19),(398,'Тетіїв',10),(399,'Тисмениця',9),(400,'Тлумач',9),(401,'Токмак',8),(402,'Торецьк',5),(403,'Тростянець',18),(404,'Трускавець',13),(405,'Тульчин',2),(406,'Турка',13),(407,'Тячів',7),(408,'Угнів',13),(409,'Ужгород',7),(410,'Узин',10),(411,'Українка',10),(412,'Українськ',5),(413,'Умань',23),(414,'Устилуг',3),(415,'Фастів',10),(416,'Феодосія',1),(417,'Харків',20),(418,'Харцизьк',5),(419,'Херсон',21),(420,'Хирів',13),(421,'Хмельницький',22),(422,'Хмільник',2),(423,'Ходорів',13),(424,'Хорол',16),(425,'Хоростків',19),(426,'Хотин',24),(427,'Хрестівка',5),(428,'Христинівка',23),(429,'Хрустальний',12),(430,'Хуст',7),(431,'Часів Яр',5),(432,'Червоноград',13),(433,'Червонопартизанськ',12),(434,'Черкаси',23),(435,'Чернівці',24),(436,'Чернігів',25),(437,'Чигирин',23),(438,'Чистякове',5),(439,'Чоп',7),(440,'Чорнобиль',10),(441,'Чорноморськ',15),(442,'Чортків',19),(443,'Чугуїв',20),(444,'Чуднів',6),(445,'Шаргород',2),(446,'Шахтарськ',5),(447,'Шепетівка',22),(448,'Шостка',18),(449,'Шпола',23),(450,'Шумськ',19),(451,'Щастя',12),(452,'Щолкіне',1),(453,'Южне',15),(454,'Южноукраїнськ',14),(455,'Яворів',13),(456,'Яготин',10),(457,'Ялта',1),(458,'Ямпіль',2),(459,'Яремче',9),(460,'Ясинувата',5);
/*!40000 ALTER TABLE `city` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `state`
--

DROP TABLE IF EXISTS `state`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `state` (
  `id` tinyint(4) NOT NULL AUTO_INCREMENT,
  `name` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=26 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `state`
--

LOCK TABLES `state` WRITE;
/*!40000 ALTER TABLE `state` DISABLE KEYS */;
INSERT INTO `state` VALUES (1,'Автономна Республіка Крим'),(2,'Вінницька область'),(3,'Волинська область'),(4,'Дніпропетровська область'),(5,'Донецька область'),(6,'Житомирська область'),(7,'Закарпатська область'),(8,'Запорізька область'),(9,'Івано-Франківська область'),(10,'Київська область'),(11,'Кіровоградська область'),(12,'Луганська область'),(13,'Львівська область'),(14,'Миколаївська область'),(15,'Одеська область'),(16,'Полтавська область'),(17,'Рівненська область'),(18,'Сумська область'),(19,'Тернопільська область'),(20,'Харківська область'),(21,'Херсонська область'),(22,'Хмельницька область'),(23,'Черкаська область'),(24,'Чернівецька область'),(25,'Чернігівська область');
/*!40000 ALTER TABLE `state` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-08-08 13:39:45
